--PRACTICE FOR ORACLE FINAL SQL IN 20241230
------------------------------------------------
--1. EMP 테이블에서 어던 종류의 직업이 있는지 JOB을 한번씩만
--출력하는데 직업의 오름차순으로 출력하시오
------------------------------------------------
SELECT DISTINCT JOB
FROM EMP;
------------------------------------------------
--2. ENAME에 대소문자 상관없이 'S'를 포함하고 있는
--데이터출력(컬럼:ENAME, JOB, SAL)
------------------------------------------------
SELECT ENAME, JOB, SAL
FROM EMP
WHERE ENAME LIKE '%S%';
------------------------------------------------
--3. ENAME의 3번재 글자가 L인 사람을 조회하시오
--(컬럼:ENAME, SAL, COMM)
------------------------------------------------
SELECT ENAME, SAL, COMM
FROM EMP
WHERE ENAME LIKE '__L%';
------------------------------------------------
--4. COMM이 NULL이 아닌 사람 중에 SAL이 1500 이상인
--사람 출력 (컬럼:ENAME, HIREDATE, SAL)
------------------------------------------------
SELECT ENAME, HIREDATE, SAL
FROM EMP
WHERE COMM IS NOT NULL 
    AND SAL >= 1500;
------------------------------------------------
--5. HIREDATE 입사일이 5월인 사람은 모두 출력(컬럼:ENAME, HIREDATE, SAL)
------------------------------------------------
SELECT ENAME, HIREDATE, SAL
FROM EMP
WHERE TO_CHAR(HIREDATE, 'MM') = 05;
------------------------------------------------
--6.
------------------------------------------------
SELECT ENAME, HIREDATE, SAL
FROM EMP
WHERE HIREDATE >= TO_DATE('1985-01-01');
------------------------------------------------
--7.
------------------------------------------------
SELECT *
FROM EMP
WHERE SAL BETWEEN 1500 AND 3000;
------------------------------------------------
--8.
------------------------------------------------
SELECT ENAME, SAL, MGR
FROM EMP
WHERE SAL BETWEEN 1500 AND 3000;
------------------------------------------------
--9.
------------------------------------------------
SELECT *
FROM EMP
WHERE JOB IN ('CLERK', 'PRESIDENT', 'MANAGER');
------------------------------------------------
--10.
------------------------------------------------
SELECT ENAME, SAL, COMM, NVL(SAL*COMM, 0)
FROM EMP;
------------------------------------------------
--11.
------------------------------------------------
SELECT ENAME, JOB, SAL
FROM EMP
WHERE SAL > 
    (
    SELECT SAL
    FROM EMP
    WHERE ENAME = 'ADAMS'
    );
------------------------------------------------
--12
------------------------------------------------
SELECT *
FROM EMP
WHERE SAL <
    (
    SELECT AVG(SAL)
    FROM EMP
    );
------------------------------------------------
--13. 
------------------------------------------------
SELECT ENAME, JOB, SAL
FROM EMP
WHERE ENAME LIKE 'A%'
OR ENAME LIKE 'S%'
OR ENAME LIKE 'M%';
------------------------------------------------
--14.
------------------------------------------------
SELECT MGR, COUNT(*), CEIL(AVG(SAL))
FROM EMP
GROUP BY MGR;
------------------------------------------------
--15.SCOTT의 월급여와 같은 월급여를 받는 사람들을 출력 (컬럼: ENAME, SAL)
------------------------------------------------
SELECT ENAME, SAL
FROM EMP
WHERE SAL =
    (
    SELECT SAL 
    FROM EMP
    WHERE ENAME = 'SCOTT'
    );
------------------------------------------------
--16. 
------------------------------------------------
SELECT ENAME, JOB
FROM EMP
WHERE LENGTH(ENAME) = 4;
------------------------------------------------
--17. 세번째 글자가 R 아니면 A
------------------------------------------------
SELECT ENAME, JOB
FROM EMP
WHERE ENAME LIKE '__R%'
    OR ENAME LIKE '__A%';
------------------------------------------------
--18. 직군별로 인원수와 최고연봉을 출력하는데 오름차순으로 출력
------------------------------------------------
SELECT JOB, COUNT(*), MAX(SAL)
FROM EMP
GROUP BY JOB
ORDER BY JOB ASC;
------------------------------------------------
--19. 
------------------------------------------------
SELECT ENAME||'의 직업은 '||JOB||'이며 입사년도는 '||TO_CHAR(HIREDATE, 'YYYY')
||'년 '||TO_CHAR(HIREDATE, 'MM')||'월입니다.' 자기소개
FROM EMP;